/*
// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

Console.WriteLine("Input first number: ");
int num1 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Input second number: ");
int num2 = Convert.ToInt32(Console.ReadLine());
 
if(num1 > num2)
{
    Console.WriteLine($"The {num1} is greater than the {num2} ");
}
else if (num1 < num2)
{
    Console.WriteLine($"The {num1} is less than the {num2} ");
}
else
{
    Console.WriteLine($"{num1} and {num2} are equal");
}
*/
/*
// Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

Console.WriteLine("Input first number: ");
int num1 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Input second number: ");
int num2 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Input third number: ");
int num3 = Convert.ToInt32(Console.ReadLine());
int maxnum = num1;

if(num2 > maxnum)
{ 
    if(num2 > num3)
    Console.WriteLine($"The maximum number = {num2} ");
    else if(num3 > maxnum)
    Console.WriteLine($"The maximum number = {num3} ");
}
else if(maxnum > num3)
{  
    Console.WriteLine($"The maximum number = {num1} ");
}
else
{
    Console.WriteLine($"The maximum number = {num3} ");
}
*/
/*
// Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

Console.WriteLine("Input number: ");
int num = Convert.ToInt32(Console.ReadLine());

if(num%2 == 0)
{
   Console.WriteLine($"{num} is the even number"); 
}
else
{
    Console.WriteLine($"{num} is the odd number");
}
*/

//