/*
// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

Console.WriteLine("Input three-digital number: ");
int number = Convert.ToInt32(Console.ReadLine());

int CutNumber(int number)
{
    int dec = number/10;

    return dec%10;
}
int newNumber = CutNumber(number);
Console.WriteLine($"Two gigital of {number} is {newNumber}");
*/

//